[
    {
        "id": 1,
        "title": "Membrane Limits in Quantum Gravity",
        "authors": ["Rafael Álvarez-García", "Daniel Kläwer", "Timo Weigand"],
        "abstract": "It is expected that infinite distance limits in the moduli space of quantum gravity are accompanied by a tower of light states. In view of the Emergent String Conjecture, this tower must either induce a decompactification or correspond to the emergence of a tensionless critical string. We study the consistency conditions implied by this conjecture on the asymptotic behaviour of quantum gravity under dimensional reduction. If the emergent string descends from a (2+1)-dimensional membrane in a higher-dimensional theory, we find that such a membrane must parametrically decouple from the Kaluza-Klein scale. We verify this censorship against emergent membrane limits, where the membrane would sit at the Kaluza-Klein scale, in the hypermultiplet moduli space of Calabi-Yau threefold compactifications of string/M-theory. At the classical level, a putative membrane limit arises, up to duality, from an M5-brane wrapping the asymptotically shrinking special Lagrangian 3-cycle corresponding to the SYZ fibre of the Calabi-Yau. We show how quantum corrections in the moduli space obstruct such a limit and instead lead to a decompactification to eleven dimensions, where the role of the M5- and M2-branes are interchanged.",
        "arxiv": "https://arxiv.org/abs/2112.09136",
        "doi": "https://doi.org/10.1103/PhysRevD.105.066024",
        "journal": "Phys.Rev.D"
    },
    {
        "id": 2,
        "title": "Modular Curves and the Refined Distance Conjecture",
        "authors": ["Daniel Kläwer"],
        "abstract": "We test the refined distance conjecture in the vector multiplet moduli space of 4D \\(\\mathcal{N}=2\\) compactifications of the type IIA string that admit a dual heterotic description. In the weakly coupled regime of the heterotic string, the moduli space geometry is governed by the perturbative heterotic dualities, which allows for exact computations. This is reflected in the type IIA frame through the existence of a K3 fibration. We identify the degree \\(d=2N\\) of the K3 fiber as a parameter that could potentially lead to large distances, which is substantiated by studying several explicit models. The moduli space geometry degenerates into the modular curve for the congruence subgroup \\(\\Gamma_0(N)^+\\). In order to probe the large \\(N\\) regime, we initiate the study of Calabi-Yau threefolds fibered by general degree \\(d>8\\) K3 surfaces by suggesting a construction as complete intersections in Grassmann bundles.",
        "arxiv": "https://arxiv.org/abs/2108.00021",
        "doi": "https://doi.org/10.1007/JHEP12(2021)088",
        "journal": "JHEP"
    },
    {
        "id": 3,
        "title": "Quantum Corrections in 4D N=1 Infinite Distance Limits and the Weak Gravity Conjecture",
        "authors": ["Daniel Kläwer", "Seung-Joo Lee", "Timo Weigand", "Max Wiesner"],
        "abstract": "We study quantum corrections in four-dimensional theories with \\(N=1\\) supersymmetry in the context of Quantum Gravity Conjectures. According to the Emergent String Conjecture, infinite distance limits in quantum gravity either lead to decompactification of the theory or result in a weakly coupled string theory. We verify this conjecture in the framework of \\(N=1\\) supersymmetric F-theory compactifications to four dimensions including perturbative \\(\\alpha'\\) as well as non-perturbative corrections. After proving uniqueness of the emergent critical string at the classical level, we show that quantum corrections obstruct precisely those limits in which the scale of the emergent critical string would lie parametrically below the Kaluza-Klein scale. Limits in which the tension of the asymptotically tensionless string sits at the Kaluza-Klein scale, by contrast, are not obstructed. In the second part of the paper we study the effect of quantum corrections for the Weak Gravity Conjecture away from the strict weak coupling limit. We propose that gauge threshold corrections and mass renormalisation effects modify the super-extremality bound in four dimensions. For the infinite distance limits in F-theory the classical super-extremality bound is generically satisfied by a sublattice of states in the tower of excitations of an emergent heterotic string. By matching the F-theory \\(\\alpha'\\) corrections to gauge threshold corrections of the dual heterotic theory we predict how the masses of this tower must be renormalised in order for the Weak Gravity Conjecture to hold at the quantum level.",
        "arxiv": "https://arxiv.org/abs/2011.00024",
        "doi": "https://doi.org/10.1007/JHEP03(2021)252",
        "journal": "JHEP"
    },
    {
        "id": 4,
        "title": "KKLT and the Swampland Conjectures",
        "authors": ["Ralph Blumenhagen", "Max Brinkmann", "Daniel Kläwer", "Andriana Makridou", "Lorenz Schlechter"],
        "abstract": "Recently, various swampland conjectures have been proposed that every UV complete effective field theory should satisfy. In particular, these deal with the properties of AdS and dS solutions arising in theories of quantum gravity. Mainly summarizing the results of our two previous articles arXiv:1902.07724 and arXiv:1910.10185, we confront the string theory based KKLT scenario with these conjectures and argue that if quantum vacua as in the KKLT construction indeed exist, some of the conjectures receive some \\(\\log\\)-corrections. Furthermore we point out some new aspects not contained in the aforementioned two papers.",
        "arxiv": "https://arxiv.org/abs/2004.09285",
        "doi": "https://doi.org/10.22323/1.376.0158",
        "journal": "PoS"
    },
    {
        "id": 5,
        "title": "Swampland Variations on a Theme by KKLT",
        "authors": ["Ralph Blumenhagen", "Daniel Kläwer", "Lorenz Schlechter"],
        "abstract": "The KKLT scenario in a warped throat, if consistent, provides a concrete counterexample to both the AdS scale separation and the dS swampland conjectures. First, we define and analyze the relevant effective field theory for the conifold modulus and the overall Kähler modulus that both have exponentially small masses. The scalar potential still admits KKLT-like AdS and dS minima. Second, we critically analyze the reliability of the employed Wilsonian effective action by evaluating the masses of light modes localized in the warped throat. The resulting mass spectrum is discussed with respect to the swampland distance conjecture. We find the recently observed emergent nature of the latter not only at large distance points but also at the conifold point motivating a general extension of it. In this respect, KKLT and trans-Planckian field distance are on equal footing. It is pointed out that the reliability of the KKLT minimum will depend on how this emergent behavior is interpreted.",
        "arxiv": "https://arxiv.org/abs/1902.07724",
        "doi": "https://doi.org/10.1007/JHEP05(2019)152",
        "journal": "JHEP"
    },
    {
        "id": 6,
        "title": "A Spin-2 Conjecture on the Swampland",
        "authors": ["Daniel Kläwer", "Dieter Lüst", "Eran Palti"],
        "abstract": "We consider effective theories with massive fields that have spins larger than or equal to two. We conjecture a universal cutoff scale on any such theory that depends on the lightest mass of such fields. This cutoff corresponds to the mass scale of an infinite tower of states, signalling the breakdown of the effective theory. The cutoff can be understood as the Weak Gravity Conjecture applied to the Stückelberg gauge field in the mass term of the high spin fields. A strong version of our conjecture applies even if the graviton itself is massive, so to massive gravity. We provide further evidence for the conjecture from string theory.",
        "arxiv": "https://arxiv.org/abs/1811.07908",
        "doi": "https://doi.org/10.1002/prop.201800102",
        "journal": "Fortschr.Phys."
    },
    {
        "id": 7,
        "title": "Machine Learning Line Bundle Cohomologies of Hypersurfaces in Toric Varieties",
        "authors": ["Daniel Kläwer", "Lorenz Schlechter"],
        "abstract": "Different techniques from machine learning are applied to the problem of computing line bundle cohomologies of (hypersurfaces in) toric varieties. While a naive approach of training a neural network to reproduce the cohomologies fails in the general case, by inspecting the underlying functional form of the data we propose a second approach. The cohomologies depend in a piecewise polynomial way on the line bundle charges. We use unsupervised learning to separate the different polynomial phases. The result is an analytic formula for the cohomologies. This can be turned into an algorithm for computing analytic expressions for arbitrary (hypersurfaces in) toric varieties.",
        "arxiv": "https://arxiv.org/abs/1809.02547",
        "doi": "https://doi.org/10.1016/j.physletb.2019.01.002",
        "journal": "Phys.Lett.B"
    },
    {
        "id": 8,
        "title": "The Refined Swampland Distance Conjecture in Calabi-Yau Moduli Spaces",
        "authors": ["Ralph Blumenhagen", "Daniel Kläwer", "Lorenz Schlechter", "Florian Wolf"],
        "abstract": "The Swampland Distance Conjecture claims that effective theories derived from a consistent theory of quantum gravity only have a finite range of validity. This will imply drastic consequences for string theory model building. The refined version of this conjecture says that this range is of the order of the naturally built in scale, namely the Planck scale. It is investigated whether the Refined Swampland Distance Conjecture is consistent with proper field distances arising in the well understood moduli spaces of Calabi-Yau compactification. Investigating in particular the non-geometric phases of Kahler moduli spaces of dimension \\(h^{1,1}\\in \\{1,2,101\\}\\), we always found proper field distances that are smaller than the Planck-length.",
        "arxiv": "https://arxiv.org/abs/1803.04989",
        "doi": "https://doi.org/10.1007/JHEP06(2018)052",
        "journal": "JHEP"
    },
    {
        "id": 9,
        "title": "Super-Planckian Spatial Field Variations and Quantum Gravity",
        "authors": ["Daniel Kläwer", "Eran Palti"],
        "abstract": "We study scenarios where a scalar field has a spatially varying vacuum expectation value such that the total field variation is super-Planckian. We focus on the case where the scalar field controls the coupling of a \\(U(1)\\) gauge field, which allows us to apply the Weak Gravity Conjecture to such configurations. We show that this leads to evidence for a conjectured property of quantum gravity that as a scalar field variation in field space asymptotes to infinity there must exist an infinite tower of states whose mass decreases as an exponential function of the scalar field variation. We determine the rate at which the mass of the states reaches this exponential behaviour showing that it occurs quickly after the field variation passes the Planck scale.",
        "arxiv": "https://arxiv.org/abs/1610.00010",
        "doi": "https://doi.org/10.1007/JHEP01(2017)088",
        "journal": "JHEP"
    }
]
